with open('data.txt', 'r', encoding='utf-8 ') as f:
    province_list = eval(f.readline())
    city_dict = eval(f.readline())
    region_dict = eval(f.readline())
    code_dict = eval(f.readline())
    city_code_dict = eval(f.readline())
# province_list =[
#     '广东', '海南', '福建', '广西',
#     '贵州', '云南', '辽宁', '黑龙江', 
#     '陕西', '甘肃', '青海', '宁夏', 
#     '新疆', '北京', '天津', '河北', 
#     '山西', '内蒙古', '山东', '河南', 
#     '湖北', '湖南', '重庆', '四川', 
#     '贵州', '云南', '西藏', '陕西', 
#     '甘肃', '青海', '宁夏', '新疆', 
#     '北京', '天津', '河北', '山西', 
#     '内蒙古', '山东', '河南', '湖北', 
#     '湖南', '重庆', ' '
# ]

# city_dict = {
#     '广东': [
#         '广州', '深圳', '珠海', '汕头', '韶关', '佛山', '江门', '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞', '中山', '潮州', '揭阳', '云浮'
#     ],
# }